# Pandas Series

Series is a one-dimensional labeled array capable of holding data of any
type (integer, string, float, python objects, etc.). The axis labels are
collectively called index.

In [1]:
# Create an empty Pandas Series
import numpy as np
import pandas as pd

s = pd.Series()
s

<ipython-input-1-b7695439defc>:5: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

Series([], dtype: float64)

In [2]:
# Create the Pandas Series by using np.array
data = np.array(["a","b","c","d"])
s = pd.Series(data)
s

0    a
1    b
2    c
3    d
dtype: object

In [3]:
# Assign the custom Index to Pandas Series
s = pd.Series(data, index = [100,101,102,103])
s

100    a
101    b
102    c
103    d
dtype: object

In [4]:
# Create the Pandas Series from Dictionary
data = {"a":1, "b":2, "c":3, "d":4, "e":5}
s = pd.Series(data)
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

# Pandas Dataframe

A Data frame is a two-dimensional data structure, i.e., data is aligned in
a tabular fashion in rows and columns.

Features of DataFrame

 Potentially columns are of different types

 Mutable

 Labeled axes (rows and columns)

 Can Perform Arithmetic operations on rows and columns

In [5]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
# Create Dataframe from single List
data = [0,1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  0
1  1
2  2
3  3
4  4
5  5

In [7]:
# Create Dataframe using Multiple Lists
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [8]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'], dtype = float)
df

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [9]:
# Create Dataframe using Pandas Dictionary
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [10]:
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [11]:
# Variable Addition in existing Pandas DataFrame
df["weight"] = pd.Series([40,50,60,70], index = ['rank1','rank2','rank3','rank4'])
df

        Name  Age  weight
rank1    Tom   28      40
rank2   Jack   34      50
rank3  Steve   29      60
rank4  Ricky   42      70

In [12]:
# Variable deletion
del df["weight"]
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [13]:
# Row Selection
print(df.loc["rank2"]) # Prints the row from DataFrame using Index name
print(df.iloc[1]) #Prints the row from DataFrame using Integer Location

Name    Jack
Age       34
Name: rank2, dtype: object
Name    Jack
Age       34
Name: rank2, dtype: object

In [14]:
# Slice the rows
df[2:4]

        Name  Age
rank3  Steve   29
rank4  Ricky   42

In [15]:
# Addition of Rows
data = {"Name":"Janice", "Age":30}
df1 = pd.DataFrame(data, index = ["rank5"])
df = df.append(df1)
df

         Name  Age
rank1     Tom   28
rank2    Jack   34
rank3   Steve   29
rank4   Ricky   42
rank5  Janice   30

In [16]:
# Deletion of Rows
df = df.drop("rank3") # Delete the rows based on Index name
df

         Name  Age
rank1     Tom   28
rank2    Jack   34
rank4   Ricky   42
rank5  Janice   30

In [17]:
df

         Name  Age
rank1     Tom   28
rank2    Jack   34
rank4   Ricky   42
rank5  Janice   30

In [18]:
df.drop(columns = "Age")

         Name
rank1     Tom
rank2    Jack
rank4   Ricky
rank5  Janice